In [1]:
import pandas as pd

### Q.1 ) Create a Pandas Series having data.....

In [2]:
series = [4,8,15,16,23,42]
print(series)

[4, 8, 15, 16, 23, 42]

### Q.2 ) Create a variable of list type containing 10 elements in it, and apply pandas.Series funtion on the variable print it.

In [3]:
listVar = ['a',23,'34',56,'cdf','e',123.456, '34.54','gh',456]
pd_series = pd.Series(listVar)
print(pd_series)

0          a
1         23
2         34
3         56
4        cdf
5          e
6    123.456
7      34.54
8         gh
9        456
dtype: object

### Q.3 ) Create a  Pandas Dataframe that contains the table and print the data

In [4]:
dataFrame = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27], 'Gender':['Female','Male','Female']}
df = pd.DataFrame(dataFrame)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q.4 ) What is 'DataFrame' in pandas and how is it different from pandas.Series? Explain with examples.

Ans:- Pandas Data frame is a two-dimensional tabular data structure in which datas are stored in a row and coloumn form. Generally the columns have labels and the datas are being stored row wise indices. It can be visualized as a csv file in real.
The individual columns can be said as the pandas series. Pandas Series is a one-dimensional labeled array that can hold data of any of the data types.
Here one example will be the above tabular form in question no. 3 is a dataframe where as the data structure in question no 2 is a series.

In [5]:
print("This is one example of dataframe")
print(df)
print("\nThis is one example of series")
print(pd_series)

This is one example of dataframe
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

This is one example of series
0          a
1         23
2         34
3         56
4        cdf
5          e
6    123.456
7      34.54
8         gh
9        456
dtype: object

### Q. 5 ) Some common functions in pandas... and examples

Function1: .read_csv()
--> It is used to read csv files into a pandas data frame.

Function2: .head()
--> It is used to return the first n rows of a dataset and if n not given then by default 5.

Function3: .tail()
--> It returns last n (default 5) rows of the dataset

Function4: .dtypes
--> Returns the data types of each labels present in the top of the columns in the data set.

Function5: .columns
--> Returns the labels in the columns, i.e. the top row of each column if not specified.

In [6]:
##Here is the example of some of the functions
print(df.columns)
print("\n")
print(df.head())

Index(['Name', 'Age', 'Gender'], dtype='object')


     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q. 6) Which is mutable in nature, series, Dataframe or panel?

Answer: 
Dataframe and Panel are mutable data structure where as series is immutable.

### Q.7 ) Create a dataframe using multiple series. Explain with an example.

In [7]:
list_one = ['Ravi','Sam','Abhi','Lopa','Roma']
s_one = pd.Series(list_one)
list_two = [12,13,45,6,7]
s_two = pd.Series(list_two)
list_three = ['50,456','59,345','45,000','34,000','78,000']
s_three = pd.Series(list_three)
s_one.name = 'Names'
s_two.name = 'Age'
s_three.name = 'Salary'
pd.concat([s_one,s_two,s_three],axis =1)

  Names  Age  Salary
0  Ravi   12  50,456
1   Sam   13  59,345
2  Abhi   45  45,000
3  Lopa    6  34,000
4  Roma    7  78,000

# -----------------OOOOOOOOOO------------------ #